In [2]:
import pandas as pd 
import numpy as np

In [6]:
# series
# it is a one-dimensional array-like object containing any data type .it is similar to column in a table            
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
series = pd.Series(data,index=['a','b','c','d','e'])
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
series_dict = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
print(series_dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [16]:
# data frame
# it is a two-dimensional array-like object containing any data type .it is similar to table in a database


#creating a data frame using dictionary of list
data = {
    'Name': ['Tom', 'Jerry', 'Mickey', 'Donald'],
    'Age': [20, 21, 22, 23],
    'City': ['New York', 'California', 'Florida', 'Texas']

}
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age        City
0     Tom   20    New York
1   Jerry   21  California
2  Mickey   22     Florida
3  Donald   23       Texas
<class 'pandas.core.frame.DataFrame'>

In [18]:
np.array(df)

array([['Tom', 20, 'New York'],
       ['Jerry', 21, 'California'],
       ['Mickey', 22, 'Florida'],
       ['Donald', 23, 'Texas']], dtype=object)

In [21]:
#creating a data frame using list of dictionary

data = [
    {'Name':'Tom', 'Age':20, 'City':'New York'},
    {'Name':'Jerry', 'Age':21, 'City':'California'},
    {'Name':'Mickey', 'Age':22, 'City':'Florida'},
    {'Name':'Donald', 'Age':23, 'City':'Texas'}
]
df = pd.DataFrame(data)
print(df)

     Name  Age        City
0     Tom   20    New York
1   Jerry   21  California
2  Mickey   22     Florida
3  Donald   23       Texas

In [22]:
pd.read_csv('sales_data1.csv')

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [24]:
df.head()

     Name  Age        City
0     Tom   20    New York
1   Jerry   21  California
2  Mickey   22     Florida
3  Donald   23       Texas

In [26]:
type(df['Name'])

pandas.core.series.Series

In [30]:
df

     Name  Age        City
0     Tom   20    New York
1   Jerry   21  California
2  Mickey   22     Florida
3  Donald   23       Texas

In [48]:
df.loc[0]# label based indexing 
# means labels k basis pe indexing hoti hai
print(df.loc[0:2])

     Name  Age        City
0     Tom   20    New York
1   Jerry   21  California
2  Mickey   22     Florida

In [49]:
df.iloc[0]# integer based indexing
print(df.iloc[0:2,0:2])

    Name  Age
0    Tom   20
1  Jerry   21

In [51]:
# accessing specific element
print(df.at[1,'Age'])

21

In [54]:
# accessing specific element using iat
print(df.iat[2,2])

Florida

In [63]:
# data manipulation with df
df['salary'] = [1000,2000,3000,4000]
print(df)

     Name  Age        City  salary
0     Tom   20    New York    1000
1   Jerry   21  California    2000
2  Mickey   22     Florida    3000
3  Donald   23       Texas    4000

In [64]:
df.drop('salary',axis=1,inplace=True)
print(df)

     Name  Age        City
0     Tom   20    New York
1   Jerry   21  California
2  Mickey   22     Florida
3  Donald   23       Texas

In [67]:
# add age to column
df['Age'] = df['Age'] + 10
print(df)

     Name  Age        City
0     Tom   50    New York
1   Jerry   51  California
2  Mickey   52     Florida
3  Donald   53       Texas

In [69]:
# dropping rowwise
df.drop(0,axis=0,inplace=True)

KeyError: '[0] not found in axis'

In [71]:
print(df)

     Name  Age        City
1   Jerry   51  California
2  Mickey   52     Florida
3  Donald   53       Texas

In [75]:
df.dtypes
df.describe()

        Age
count   3.0
mean   52.0
std     1.0
min    51.0
25%    51.5
50%    52.0
75%    52.5
max    53.0

In [ ]:
grouped = df.groupby('City')